graph fix
